УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_ОписанияОпасныхГрузов/КонтурЛогистика_ОписанияОпасныхГрузов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ОписанияОпасныхГрузов</name>
  <attributes>
    <name>НомерООН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НадлежащееОтгрузочноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>EnumRef.КонтурЛогистика_КлассыОпасностиГрузов</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаУпаковки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ГруппыУпаковки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗнакОпасности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОграниченияТуннели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Радионуклиды</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеФизХимФормы</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксАктивностьРадиации</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияУпаковки</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортныйИндекс</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексБезопасности</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпознавательныйЗнакСертификатов</name>
    <comment>Опознавательный знак для каждого сертификата об утверждении компетентного органа, применимый для данного груза</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолнаяАктивностьГруза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбМасНетВзрСод</name>
    <comment>обязательно для класса 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбМасНетВзрСодВсех</name>
    <comment>обязательно для класса 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцСмеси</name>
    <comment>Дополнительные положения для класса 2.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИстеченияВремениУдержания</name>
    <comment>ДатИстВрУдер Дополнительные положения для класса 2.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяТемпература</name>
    <comment>Контрольная температура, в градусах</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АварийнаяТемпература</name>
    <comment>Аварийная температура, в градусах</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_ОписанияОпасныхГрузов/ManagerModule.bsl
// Получить описание опасного груза
//
// Параметры:
//  НомерООН			 - Строка	 - номер ООН
//  КлассификационныйКод - Строка	 - классификационный код
//  ГруппаУпаковки		 - Строка, ПеречислениеСсылка.КонтурЛогистика_ГруппыУпаковки	 - группа упаковки
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурЛогистика_ОписанияОпасныхГрузов - описание груза
//
Функция ПолучитьОписаниеОпасногоГруза(НомерООН, КлассификационныйКод = Неопределено, ГруппаУпаковки = Неопределено) Экспорт
	
	Если ТипЗнч(ГруппаУпаковки) = Тип("ПеречислениеСсылка.КонтурЛогистика_ГруппыУпаковки") Тогда
		ГруппаУпаковкиЗначение = ГруппаУпаковки;
	Иначе
		// Пробуем сконвертировать
		Попытка
			ГруппаУпаковкиЗначение = Перечисления.КонтурЛогистика_ГруппыУпаковки[ГруппаУпаковки];
		Исключение
			ГруппаУпаковкиЗначение = ГруппаУпаковки;
		КонецПопытки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерООН", НомерООН);
	Запрос.УстановитьПараметр("ОтборПоКлассификационныйКод", ЗначениеЗаполнено(КлассификационныйКод));
	Запрос.УстановитьПараметр("КлассификационныйКод", КлассификационныйКод);
	Запрос.УстановитьПараметр("ОтборПоГруппаУпаковки", ЗначениеЗаполнено(ГруппаУпаковкиЗначение));
	Запрос.УстановитьПараметр("ГруппаУпаковки", ГруппаУпаковкиЗначение);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_ОписанияОпасныхГрузов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОписанияОпасныхГрузов КАК КонтурЛогистика_ОписанияОпасныхГрузов
	|ГДЕ
	|	НЕ КонтурЛогистика_ОписанияОпасныхГрузов.ПометкаУдаления
	|	И КонтурЛогистика_ОписанияОпасныхГрузов.НомерООН = &НомерООН
	|	И (НЕ &ОтборПоКлассификационныйКод
	|			ИЛИ &ОтборПоКлассификационныйКод
	|				И КонтурЛогистика_ОписанияОпасныхГрузов.КлассификационныйКод = &КлассификационныйКод)
	|	И (НЕ &ОтборПоГруппаУпаковки
	|			ИЛИ &ОтборПоГруппаУпаковки
	|				И КонтурЛогистика_ОписанияОпасныхГрузов.ГруппаУпаковки = &ГруппаУпаковки)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Берем первую
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции
